rest-server/src/soap/client/CAPSoapHttp.getMessage.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="http://gov.fema.ipaws.services/caprequest"
    xmlns:ns3="http://gov.fema.ipaws.services/capresponse"
    xmlns:ns22="urn:oasis:names:tc:emergency:cap:1.2"
    xmlns:ns1="http://gov.fema.ipaws.services/IPAWS_CAPService/">
 <SOAP-ENV:Body>
   <ns1:getMessageTypeDef>
    <ns2:requestAPI></ns2:requestAPI>
    <ns2:requestOperation></ns2:requestOperation>
    <ns2:parameters>
     <ns2:parameterName></ns2:parameterName>
     <ns2:comparisonOp></ns2:comparisonOp>
     <ns2:parameterValue></ns2:parameterValue>
     <ns2:logicalOp></ns2:logicalOp>
    </ns2:parameters>
   </ns1:getMessageTypeDef>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
